Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.WorstLoadScenario
The coincident load applied load case.
Will be set appropriately after computation.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.TotalDemandLoad
The Total Demand Load
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData.NumberOfPhases
The number of phases.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
Represents the data and parameters of electrical analytical node.
Since:
2023